export default {
  "/基础/架构/": [
    {
      text: "常见架构",
      link: "/基础/架构/常见架构/",
      children: [
        {
          text: "mvc架构",
          link: "/基础/架构/常见架构/mvc",
        },
        {
          text: "mvp架构",
          link: "/基础/架构/常见架构/mvp",
        },
        {
          text: "mvvm架构",
          link: "/基础/架构/常见架构/MVVM",
        },
        {
          text: "六边形架构",
          link: "/基础/架构/常见架构/六边形架构",
        },
        {
          text: "洋葱圈架构",
          link: "/基础/架构/常见架构/洋葱圈架构",
        },
        {
          text: "整洁架构",
          link: "/基础/架构/常见架构/整洁架构",
        },
      ],
    },
    {
      text: "仓库组织",
      link: "/基础/架构/仓库组织/",
    },
    {
      text: "目录组织",
      link: "/基础/架构/目录组织/",
    },
  ],
};
