const collapsable = true;
export default {
  "/前端/前端工程化/代码规范/": [
    {
      text: "代码规范工作流",
      link: "/前端/前端工程化/代码规范/代码规范工作流",
    },
  ],
  "/前端/前端工程化/代码质量": [
    {
      text: "linter",
      link: "/前端/前端工程化/代码质量/linter/eslint/eslint插件编写",
    },
    {
      text: "TypeScript",
      link: "/前端/前端工程化/代码质量/静态语言/TypeScript",
      children: [
        {
          text: "基本语法",
          link: "/前端/前端工程化/代码质量/静态语言/TypeScript/TS基本语法",
        },
        {
          text: "声明文件",
          link: "/前端/前端工程化/代码质量/静态语言/TypeScript/types",
        },
        {
          text: "TypeScript构建方案",
          link: "/前端/前端工程化/代码质量/静态语言/TypeScript/TypeScript构建方案",
        },
      ],
    },
    {
      text: "单元测试",
      link: "/前端/前端工程化/代码质量/单元测试/单元测试选型",
    },
    {
      text: "监控",
      link: "/前端/前端工程化/代码质量/监控/前端监控",
    },
    {
      text: "web安全",
      link: "/前端/前端工程化/代码质量/web安全/XSS",
    },
    {
      text: "代码",
      link: "/前端/前端工程化/代码质量/代码/",
      children: [
        {
          text: "无用代码",
          link: "/前端/前端工程化/代码质量/代码/无用代码",
        },
        {
          text: "重复代码",
          link: "/前端/前端工程化/代码质量/代码/重复代码",
        },
        {
          text: "代码复杂度",
          link: "/前端/前端工程化/代码质量/代码/代码复杂度",
        },
        {
          text: "依赖管理",
          link: "/前端/前端工程化/代码质量/代码/依赖管理",
        },
      ],
    },
  ],
  "/前端/前端工程化/开发效率/": [
    {
      text: "组件库",
      link: "/前端/前端工程化/开发效率/组件库",
    },
    {
      text: "工具库",
      link: "/前端/前端工程化/开发效率/工具库/工具库搭建",
    },
    {
      text: "脚手架",
      link: "/前端/前端工程化/开发效率/脚手架",
    },
  ],
  "/基础/前端工程化/性能优化/": [
    {
      text: "性能优化",
      link: "/前端/前端工程化/性能优化/",
    },
  ],
  "/前端/前端工程化/开发流程/": [
    {
      text: "git",
      link: "/前端/前端工程化/开发流程/版本控制/git",
    },
    {
      text: "CICD",
      link: "/前端/前端工程化/开发流程/部署/CICD",
    },
  ],
};
